00_simpleFoam/system/streamlines_recirculation
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out files of streamlines with interpolated field data in VTK format.

\*---------------------------------------------------------------------------*/
direction       both;

seedSampleSet
{
    type            lineUniform;
    start           (10 0.5 0);
    end             (10 0.5 1.2);
    nPoints         24;
    axis            x;
}

fields          (U);


// Must be last entry
#includeEtc "caseDicts/postProcessing/visualization/streamlines.cfg"

// ************************************************************************* //
